cleanli2/stm32/src/common.c
  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

  STM_COMInit(COM1, &USART_InitStructure);
  /* To achieve GPIO toggling maximum frequency, the following  sequence is mandatory. 
     You can monitor PD0 or PD2 on the scope to measure the output signal. 
     If you need to fine tune this frequency, you can add more GPIO set/reset 
     cycles to minimize more the infinite loop timing.
     This code needs to be compiled with high speed optimization option.  */

  //PB3 PB4 PA15 PA13 PA14 set to gpio instead of SWJ
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
  //Touch_Test();

  //72M/72=1M, 1us/count
  timer_init(10000, 72-1);

  GPIO_InitTypeDef GPIO_InitStructure;
  //led
#ifdef ALIENTEK_MINI
  RTC_Init();
  lprintf_time("\n\n================ALIENTEK_MINI board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_8);
  GPIO_ResetBits(GPIOA,GPIO_Pin_13);

  RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);

  RCC_APB2PeriphClockCmd(LED0_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = LED0_GPIO_PIN;
  GPIO_Init(LED0_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(LED0_GPIO_GROUP, LED0_GPIO_PIN);

  RCC_APB2PeriphClockCmd(LED1_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = LED1_GPIO_PIN;
  GPIO_Init(LED1_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(LED1_GPIO_GROUP, LED1_GPIO_PIN);
#else
  lprintf_time("\n\n================Hamer board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_0;//PB4 spi flash cs
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOB,GPIO_Pin_0);	
  GPIO_SetBits(GPIOB,GPIO_Pin_4);//spi flash cs =1

  RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
#endif
  //led end

  RCC_GetClocksFreq(&RCC_ClocksStatus);
  lprintf_time("Version %s%s\n", VERSION, GIT_SHA1);
  get_rtc_time(0);
  lprintf_time("%s\n", get_rtc_time(0));
  lprintf("clk %d %d %d %d %d Hz\n\r",
		  RCC_ClocksStatus.SYSCLK_Frequency,
		  RCC_ClocksStatus.HCLK_Frequency,
		  RCC_ClocksStatus.PCLK1_Frequency,
		  RCC_ClocksStatus.PCLK2_Frequency,
		  RCC_ClocksStatus.ADCCLK_Frequency);
  lprintf_time("lcd init\n");
  lcd_sueb_init(0);
  lprintf_time("lcd init done.\n");
  lprintf_time("SD init\n");
  SD_Init();
  lprintf_time("SD init done\n");
  //SD_LowLevel_Init();

  /*1us/timer_count, 10ms/timer_intrpt*/
  while (looptimes--)
  {
      led_flash(0x3, 100);
  }
  beep_by_timer_100(0);
  //while(1) run_cmd_interface();
#if 0
  ict=0;
  lcd_clr_window(0xf00f, 0, 0, 100, 100);
  lcd_clr_window(BLUE, 0, 100, 100, 200);
  lcd_clr_window(0xff0f, 0, 200, 100, 300);
  lcd_lprintf(5, 250, "PowerOff");
  lcd_clr_window(0xff, 0, 300, 100, 400);
  lcd_lprintf(5, 350, "Timer");

  //reboot to download mode
  lcd_clr_window(RED, 0, 400, 100, 480);
  lcd_lprintf(5, 450, "Download");

  lcd_clr_window(0, 120, 760, 400, 780);
  lcd_clr_window(0xf0f, 120, 760, 163, 780);

  lcd_clr_window(GREEN, 40, 500, 440, 600);
  lcd_clr_window(0xf0f, 56, 500, 440, 600);
  LCD_DrawLine(71, 500, 71, 600);
  LCD_DrawLine(109, 500, 109, 600);//5min
  LCD_DrawLine(138, 500, 138, 600);//10min
  LCD_DrawLine(210, 500, 210, 600);//30min
  LCD_DrawLine(280, 500, 280, 600);//60min
  lcd_lprintf(60, 580, "0 hours 0 minutes 16 seconds");
  lcd_lprintf(68, 620, "1    5   10       30        60  mins");
  auto_time_alert_set(AUTO_TIME_ALERT_INC_MINS);
  {
      char*date = get_rtc_time(0);
      Show_Str(190, 700,0,0xffff,(uint8_t*)date,24,0);
      if(check_rtc_alert_and_clear()){
          my_repeat_timer(3, 300);
      }
  }
  while(1){
      static uint32_t no_touch_count = 0;
      uint16_t tx = 0, ty=0;
      if(ict==0){
          char*date = get_rtc_time(&g_cur_date);
          if(g_timer.running){//timer
              uint32_t timer_ran = time_diff_seconds(&g_cur_date, &g_timer.start);
              if(timer_ran>g_timer.seconds_len){
                  beep(800, 3000);
                  if(g_timer.to_repeat>1){
                      g_timer.to_repeat--;
                      g_timer.start = g_cur_date;
                      update_progress_indicator(&g_timer_repeat_pi,
                              g_timer.repeat - g_timer.to_repeat,
                              g_timer.repeat);
                  }
                  else{
                      g_timer.running = 0;
                      if(g_timer.timeout_poff){
                          power_off();
                      }
                  }
              }
              else{
                  update_progress_indicator(&g_timer_pi, timer_ran, g_timer.seconds_len);
              }
          }
          Show_Str(190, 700,0,0xffff,(uint8_t*)date,24,0);
          adc_test();
          lprintf("sys_us %U\n", get_system_us());;
      }
      if(ict++>600){
          ict = 0;
      }
      delay_ms(1);
      if(get_TP_point(&tx, &ty)){
          no_touch_count = 0;
          if(get_BL_value()<=DEFAULT_IDLE_BL){
              set_BL_value(DEFAULT_BL);
          }
          TP_Draw_Big_Point(tx,ty,BLACK);		//画图
          if(tx < 100 && ty < 480 && ty > 400){//single timer
              reboot_download();
          }
          if(tx < 100 && ty < 400 && ty > 300){//single timer
              my_repeat_timer(1, single_timer_len);
          }
          if(tx < 100 && ty < 300 && ty > 200){//poweroff
              power_off();
          }
          if(tx < 100 && ty < 200 && ty > 100){
              my_repeat_timer(3, 10);
              //beep(1000, 2000);
          }
          if(tx < 100 && ty < 100){
              my_repeat_timer(3, 300);
              //beep(1000, 2000);
          }
          if(tx < 400 && tx > 120 && ty < 780 && ty > 760){
              uint16_t lcd_brt;
              lcd_clr_window(0, 120, 760, 400, 780);
              lcd_clr_window(0xf0f, 120, 760, tx, 780);
              lcd_brt = (tx - 120)*100/280;
              set_BL_value(lcd_brt);
          }
          if(tx < 440 && tx > 40 && ty < 600 && ty > 500){
              if(!g_timer.running){
                  uint32_t h, m, s;
                  lcd_clr_window(GREEN, 40, 500, 440, 600);
                  lcd_clr_window(0xf0f, 40, 500, tx, 600);
                  LCD_DrawLine(71, 500, 71, 600);//11min
                  LCD_DrawLine(109, 500, 109, 600);//5min
                  LCD_DrawLine(138, 500, 138, 600);//10min
                  LCD_DrawLine(210, 500, 210, 600);//30min
                  LCD_DrawLine(280, 500, 280, 600);//60min
                  single_timer_len = (tx - 40)*(tx - 40)/16;
                  h = single_timer_len/3600;
                  m = (single_timer_len%3600)/60;
                  s = single_timer_len%60;
                  lcd_lprintf(60, 580, "%d hours %d minutes %d seconds", h, m, s);
              }
          }
      }
      if(con_is_recved() && (con_recv() == 'c')){
          run_cmd_interface();
      }
      if(!g_timer.running){
          if(no_touch_count>AUTO_POWER_OFF_COUNT){
              if((no_touch_count-AUTO_POWER_OFF_COUNT)%1000 == 0){
                  beep(1000-(no_touch_count-AUTO_POWER_OFF_COUNT)/100, 200);
              }
              if(no_touch_count-AUTO_POWER_OFF_COUNT>9000)power_off();
          }
      }
      if(no_touch_count++>AUTO_POWER_OFF_COUNT/5){
          if(((no_touch_count/2000)%10) == 0){
              if(get_BL_value() != DEFAULT_BL) set_BL_value(DEFAULT_BL);
          }
          else{
              if(get_BL_value() != DEFAULT_IDLE_BL) set_BL_value(DEFAULT_IDLE_BL);
          }
      }
  }
#endif
}

void soft_reset_system()
{
    lprintf_time("system reset\n");
    foce_save_log_func();
    set_BL_value(0);
    LCD_RESET();
    __disable_fault_irq();
    NVIC_SystemReset();
}

