cleanli2/stm32/src/common.c
void reboot_download()
{
    lprintf_time("reboot download\n");
    GPIO_SetBits(GPIOA,GPIO_Pin_13);
    beep(100, 500);
    lprintf_time("reboot download\n");
    foce_save_log_func();
    soft_reset_system();
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  lprintf("Wrong parameters value: file %s on line %d\r\n", file, line);
  /* Infinite loop */
  while (1)
  {
  }
}

#endif

/************************util***********************/
uint add_with_limit(uint a, uint b, uint limit)
{
    uint ret = a + b;
    if(ret >= limit){
        ret -= limit;
    }
    return ret;
}

/*DAC code*/
void Dac1_Init(void)
{

	GPIO_InitTypeDef GPIO_InitStructure;
	DAC_InitTypeDef DAC_InitType;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE );	  //enable port A clk
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE );	  //enable DAC clk

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;				 //config port
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN; 		 //analog input
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_SetBits(GPIOA,GPIO_Pin_4)	;//PA.4 output high

	DAC_InitType.DAC_Trigger=DAC_Trigger_None;	//no trigger
	DAC_InitType.DAC_WaveGeneration=DAC_WaveGeneration_None;//no wave
	DAC_InitType.DAC_LFSRUnmask_TriangleAmplitude=DAC_LFSRUnmask_Bit0;//mask ampitude
	DAC_InitType.DAC_OutputBuffer=DAC_OutputBuffer_Disable ;	//DAC1 output buf close, BOFF1=1
	DAC_Init(DAC_Channel_1,&DAC_InitType);	 //init DAC1

	DAC_Cmd(DAC_Channel_1, ENABLE);  //enable DAC1

	DAC_SetChannel1Data(DAC_Align_12b_R, 0);  //12bit right align

    lprintf("dac1 init done\n");
}

void Dac1_Set_Vol(u32 vol)
{
    //lprintf("set vol %X\n", vol&0xfff);
	DAC_SetChannel1Data(DAC_Align_12b_R,vol&0xFFF);
}

u16 sin_value[10]={
    0,
    711,
    1401,
    2048,
    2632,//40
    3137,
    3546,
    3849,//70
    4033,
    4095
};
void Dac1_wave(u32 type)
{
    u32 va=0,i;
    switch(type){
        case 0:
            for(va=0;va<0x1000;va+=40){
                Dac1_Set_Vol(va);
            }
            break;
        case 1:
            for(i=0;i<36*9;i++){
                va=i%36;
                if(va<10){
                    Dac1_Set_Vol(sin_value[va]/2+2048);
                }
                else if(va<18){
                    Dac1_Set_Vol(sin_value[18-va]/2+2048);
                }
                else if(va<27){
                    Dac1_Set_Vol(2048-sin_value[va-18]/2);
                }
                else{
                    Dac1_Set_Vol(2048-sin_value[36-va]/2);
                }
            }
            break;
        default:
            break;
    }
}

void Dac1_DeInit(void)
{
	DAC_Cmd(DAC_Channel_1, DISABLE);
    DAC_DeInit();
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, DISABLE);
    lprintf("dac1 deinit done\n");
}
